# Import libs

In [1]:
import pandas as pd

# Fetch Data

In [2]:
df = pd.read_csv('../data/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Column Selection

In [6]:
df["Age"]
#Return Series

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [7]:
df[["Name","Age"]].head()
#Return as DataFrame

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

# Row Slicing

In [11]:
df[
    1:8
    ]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

# Advanced Selection

In [17]:
display(df[0:10].filter(like="S"))
#Select columns having 'S' in their names

display(df[10:20].filter(regex="^A"))
#Select columns starting with 'A'

   Survived     Sex  SibSp
0         0    male      1
1         1  female      1
2         1  female      0
3         1  female      1
4         0    male      0
5         0    male      0
6         0    male      0
7         0    male      3
8         1  female      0
9         1  female      1

     Age
10   4.0
11  58.0
12  20.0
13  39.0
14  14.0
15  55.0
16   2.0
17   NaN
18  31.0
19   NaN

In [28]:
df.select_dtypes(include=["float64","int64"])
#Select columns of specific data type

     PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0              1         0       3  22.0      1      0   7.2500
1              2         1       1  38.0      1      0  71.2833
2              3         1       3  26.0      0      0   7.9250
3              4         1       1  35.0      1      0  53.1000
4              5         0       3  35.0      0      0   8.0500
..           ...       ...     ...   ...    ...    ...      ...
886          887         0       2  27.0      0      0  13.0000
887          888         1       1  19.0      0      0  30.0000
888          889         0       3   NaN      1      2  23.4500
889          890         1       1  26.0      0      0  30.0000
890          891         0       3  32.0      0      0   7.7500

[891 rows x 7 columns]

# Chain Filtering

In [ ]:
df[df["Age"] > 27].loc[:,["Name","Age","Survived"]].head(8)

                                                 Name   Age  Survived
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0         1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0         1
4                            Allen, Mr. William Henry  35.0         0
6                             McCarthy, Mr. Timothy J  54.0         0
11                           Bonnell, Miss. Elizabeth  58.0         1
13                        Andersson, Mr. Anders Johan  39.0         0
15                   Hewlett, Mrs. (Mary D Kingcome)   55.0         1
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...  31.0         0

In [27]:
df[df["Age"] > 27][["Name","Age","Survived"]].head(8)

                                                 Name   Age  Survived
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0         1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0         1
4                            Allen, Mr. William Henry  35.0         0
6                             McCarthy, Mr. Timothy J  54.0         0
11                           Bonnell, Miss. Elizabeth  58.0         1
13                        Andersson, Mr. Anders Johan  39.0         0
15                   Hewlett, Mrs. (Mary D Kingcome)   55.0         1
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...  31.0         0

In [30]:
df[df["Age"] > 27][["Name","Age","Fare"]].describe()

              Age        Fare
count  377.000000  377.000000
mean    40.265252   38.851005
std     10.586645   58.956612
min     28.000000    0.000000
25%     32.000000    9.483300
50%     37.000000   21.075000
75%     47.000000   40.125000
max     80.000000  512.329200